### IS727272 - Cordero Hernández, Marco Ricardo

# 8. Manipulación de Dataframes (DF)

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.array([[1, 8, 3], [5, 6, 7]]), index = ['a', 'b'], columns = list('123'))
df

   1  2  3
a  1  8  3
b  5  6  7

## 8.1 Estadística de DF

### Suma por columnas o filas

In [3]:
# Suma por columnas
df.sum()

1     6
2    14
3    10
dtype: int64

In [4]:
# Suma por filas
df.sum(axis = 1)

a    12
b    18
dtype: int64

### Valores mínimos y máximos por columnas o filas

In [5]:
#Por columnas
minimo_col = df.min()
max_col = df.max()

print(minimo_col, max_col, sep='\n\n')

1    1
2    6
3    3
dtype: int32

1    5
2    8
3    7
dtype: int32

In [6]:
#Por filas
minimo_fila = df.min(axis = 1)
maximo_fila = df.max(axis = 1)

print(minimo_fila, maximo_fila, sep='\n\n')

a    1
b    5
dtype: int32

a    8
b    7
dtype: int32

### Descripción de un DF

In [7]:
df

   1  2  3
a  1  8  3
b  5  6  7

In [8]:
df.describe()

              1         2         3
count  2.000000  2.000000  2.000000
mean   3.000000  7.000000  5.000000
std    2.828427  1.414214  2.828427
min    1.000000  6.000000  3.000000
25%    2.000000  6.500000  4.000000
50%    3.000000  7.000000  5.000000
75%    4.000000  7.500000  6.000000
max    5.000000  8.000000  7.000000

## 8.2 Valores nulos - NaN

In [9]:
lista_valores = ['1', '2', np.nan, '4']
print(lista_valores)

['1', '2', nan, '4']

In [10]:
serie = pd.Series(lista_valores, index = list('abcd'))
print(serie)

a      1
b      2
c    NaN
d      4
dtype: object

In [11]:
serie.isnull()

a    False
b    False
c     True
d    False
dtype: bool

In [12]:
serie.dropna()

a    1
b    2
d    4
dtype: object

In [13]:
serie

a      1
b      2
c    NaN
d      4
dtype: object

In [14]:
serie = serie.dropna()
serie

a    1
b    2
d    4
dtype: object

### Utilizando Dataframes

In [15]:
lista_valores = [[1, 2, 3], [4, np.nan, 5], [6, 7, np.nan]]
lista_indices = list('123')
lista_columnas = list('abc')

df = pd.DataFrame(lista_valores, index = lista_indices, columns = lista_columnas)
df

   a    b    c
1  1  2.0  3.0
2  4  NaN  5.0
3  6  7.0  NaN

In [16]:
df.isna()

       a      b      c
1  False  False  False
2  False   True  False
3  False  False   True

In [17]:
# Quita todo el registro
df.dropna()

   a    b    c
1  1  2.0  3.0

In [18]:
df.fillna(0)

   a    b    c
1  1  2.0  3.0
2  4  0.0  5.0
3  6  7.0  0.0